org-contrib/gsoc2012/student-projects/org-sync/index.org
# Created 2021-06-15 Tue 18:21
#+OPTIONS: H:3 num:nil toc:2 \n:nil ::t |:t ^:{} -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+TITLE: Org-sync
#+AUTHOR: Aurélien Aptel
#+startup: align fold nodlcheck hidestars oddeven lognotestate hideblocks
#+seq_todo: TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+tags: Write(w) Update(u) Fix(f) Check(c) noexport(n)
#+language: en
#+html_link_up: ../../index.html
#+html_link_home: https://orgmode.org/worg/
#+exclude_tags: noexport

/Let Org-mode synchronize with bugtrackers/

* General Information

| Version | 0.2                                              |
| License | [[http://www.gnu.org/licenses/gpl.html][GPL V3]] |
| Author  | Aurélien Aptel                                   |
| Contact | aurelien.aptel@gmail.com                         |

* Org-sync
** TODO Need to update link to repo
** About

Org-sync is a tool to synchronize your Org-mode documents with
bugtracking tools such as Bugzilla, Github or Google Code and other
TODO-list services such as [[http://www.toodledo.com/][Toodledo]] or Google Task.

Currently, the github and bitbucket backends are implemented and
should work properly. *Note*: Github bug descriptions are imported
without translating any markup (prefixed with =:=) in order to not
mess up the Org-mode buffer.

** Project Goals

- Integrate and complete org-element.el
- Write a library for bugtracker backends
- Write several backends

** Usage

See:
- [[file:tutorial/index.org][Tutorial with screenshots]]
- [[https://www.youtube.com/watch?v=kbj6-j0teCY][Demonstration video on youtube]]

** Links
- [[file:gnu-application.org][The original application for GSoC]]
- [[file:backends.org][org-sync backends]]
