org-contrib/gsoc2012/student-projects/org-sync/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-15 Tue 18:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org-sync</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Aurélien Aptel" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
 <link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="https://orgmode.org/worg/"> HOME </a>
</div><div id="content">
<h1 class="title">Org-sync</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgee1d5d8">General Information</a></li>
<li><a href="#org8ca000b">Org-sync</a>
<ul>
<li><a href="#org6ca2b3e"><span class="todo TODO">TODO</span> Need to update link to repo</a></li>
<li><a href="#org10cdb5d">About</a></li>
<li><a href="#org8e06251">Project Goals</a></li>
<li><a href="#org8888cf8">Usage</a></li>
<li><a href="#orgf2caf0b">Links</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<i>Let Org-mode synchronize with bugtrackers</i>
</p>

<div id="outline-container-orgee1d5d8" class="outline-2">
<h2 id="orgee1d5d8">General Information</h2>
<div class="outline-text-2" id="text-orgee1d5d8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Version</td>
<td class="org-left">0.2</td>
</tr>

<tr>
<td class="org-left">License</td>
<td class="org-left"><a href="http://www.gnu.org/licenses/gpl.html">GPL V3</a></td>
</tr>

<tr>
<td class="org-left">Author</td>
<td class="org-left">Aurélien Aptel</td>
</tr>

<tr>
<td class="org-left">Contact</td>
<td class="org-left">aurelien.aptel@gmail.com</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8ca000b" class="outline-2">
<h2 id="org8ca000b">Org-sync</h2>
<div class="outline-text-2" id="text-org8ca000b">
</div>
<div id="outline-container-org6ca2b3e" class="outline-3">
<h3 id="org6ca2b3e"><span class="todo TODO">TODO</span> Need to update link to repo</h3>
</div>
<div id="outline-container-org10cdb5d" class="outline-3">
<h3 id="org10cdb5d">About</h3>
<div class="outline-text-3" id="text-org10cdb5d">
<p>
Org-sync is a tool to synchronize your Org-mode documents with
bugtracking tools such as Bugzilla, Github or Google Code and other
TODO-list services such as <a href="http://www.toodledo.com/">Toodledo</a> or Google Task.
</p>

<p>
Currently, the github and bitbucket backends are implemented and
should work properly. <b>Note</b>: Github bug descriptions are imported
without translating any markup (prefixed with <code>:</code>) in order to not
mess up the Org-mode buffer.
</p>
</div>
</div>

<div id="outline-container-org8e06251" class="outline-3">
<h3 id="org8e06251">Project Goals</h3>
<div class="outline-text-3" id="text-org8e06251">
<ul class="org-ul">
<li>Integrate and complete org-element.el</li>
<li>Write a library for bugtracker backends</li>
<li>Write several backends</li>
</ul>
</div>
</div>

<div id="outline-container-org8888cf8" class="outline-3">
<h3 id="org8888cf8">Usage</h3>
<div class="outline-text-3" id="text-org8888cf8">
<p>
See:
</p>
<ul class="org-ul">
<li><a href="tutorial/index.html">Tutorial with screenshots</a></li>
<li><a href="https://www.youtube.com/watch?v=kbj6-j0teCY">Demonstration video on youtube</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf2caf0b" class="outline-3">
<h3 id="orgf2caf0b">Links</h3>
<div class="outline-text-3" id="text-orgf2caf0b">
<ul class="org-ul">
<li><a href="gnu-application.html">The original application for GSoC</a></li>
<li><a href="backends.html">org-sync backends</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Aurélien Aptel</p>
<p class="date">Created: 2021-06-15 Tue 18:21</p>
</div>
</body>
</html>
